<details>
<summary>Execution result of "plan --all --no-color" in "./live"</summary>

```terraform
06:57:01.333 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./membership

Group 2
- Module ./repository

Group 3
- Module ./organization


06:57:01.778 STDOUT [membership] tofu: OpenTofu used the selected providers to generate the following execution
06:57:01.778 STDOUT [membership] tofu: plan. Resource actions are indicated with the following symbols:
06:57:01.778 STDOUT [membership] tofu:   + create
06:57:01.778 STDOUT [membership] tofu: OpenTofu will perform the following actions:
06:57:01.778 STDOUT [membership] tofu:   # github_membership.all["reinhud"] will be created
06:57:01.778 STDOUT [membership] tofu:   + resource "github_membership" "all" {
06:57:01.778 STDOUT [membership] tofu:       + downgrade_on_destroy = false
06:57:01.778 STDOUT [membership] tofu:       + etag                 = (known after apply)
06:57:01.778 STDOUT [membership] tofu:       + id                   = (known after apply)
06:57:01.778 STDOUT [membership] tofu:       + role                 = "admin"
06:57:01.778 STDOUT [membership] tofu:       + username             = "reinhud"
06:57:01.778 STDOUT [membership] tofu:     }
06:57:01.778 STDOUT [membership] tofu:   # github_team.all["admin"] will be created
06:57:01.778 STDOUT [membership] tofu:   + resource "github_team" "all" {
06:57:01.778 STDOUT [membership] tofu:       + create_default_maintainer = false
06:57:01.778 STDOUT [membership] tofu:       + description               = "Organization wide access, manages day to day organization management"
06:57:01.779 STDOUT [membership] tofu:       + etag                      = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + id                        = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + members_count             = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + name                      = "admin"
06:57:01.779 STDOUT [membership] tofu:       + node_id                   = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + privacy                   = "closed"
06:57:01.779 STDOUT [membership] tofu:       + slug                      = (known after apply)
06:57:01.779 STDOUT [membership] tofu:     }
06:57:01.779 STDOUT [membership] tofu:   # github_team.all["ai"] will be created
06:57:01.779 STDOUT [membership] tofu:   + resource "github_team" "all" {
06:57:01.779 STDOUT [membership] tofu:       + create_default_maintainer = false
06:57:01.779 STDOUT [membership] tofu:       + description               = "AI/ML engineering team"
06:57:01.779 STDOUT [membership] tofu:       + etag                      = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + id                        = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + members_count             = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + name                      = "ai"
06:57:01.779 STDOUT [membership] tofu:       + node_id                   = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
06:57:01.779 STDOUT [membership] tofu:       + privacy                   = "closed"
06:57:01.779 STDOUT [membership] tofu:       + slug                      = (known after apply)
06:57:01.779 STDOUT [membership] tofu:     }
06:57:01.779 STDOUT [membership] tofu:   # github_team.all["app"] will be created
06:57:01.780 STDOUT [membership] tofu:   + resource "github_team" "all" {
06:57:01.780 STDOUT [membership] tofu:       + create_default_maintainer = false
06:57:01.780 STDOUT [membership] tofu:       + description               = "Application development team"
06:57:01.780 STDOUT [membership] tofu:       + etag                      = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + id                        = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + members_count             = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + name                      = "app"
06:57:01.780 STDOUT [membership] tofu:       + node_id                   = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + privacy                   = "closed"
06:57:01.780 STDOUT [membership] tofu:       + slug                      = (known after apply)
06:57:01.780 STDOUT [membership] tofu:     }
06:57:01.780 STDOUT [membership] tofu:   # github_team.all["platform"] will be created
06:57:01.780 STDOUT [membership] tofu:   + resource "github_team" "all" {
06:57:01.780 STDOUT [membership] tofu:       + create_default_maintainer = false
06:57:01.780 STDOUT [membership] tofu:       + description               = "Platform engineering and infrastructure team"
06:57:01.780 STDOUT [membership] tofu:       + etag                      = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + id                        = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + members_count             = (known after apply)
06:57:01.780 STDOUT [membership] tofu:       + name                      = "platform"
06:57:01.780 STDOUT [membership] tofu:       + node_id                   = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + parent_team_read_id       = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + parent_team_read_slug     = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + privacy                   = "closed"
06:57:01.781 STDOUT [membership] tofu:       + slug                      = (known after apply)
06:57:01.781 STDOUT [membership] tofu:     }
06:57:01.781 STDOUT [membership] tofu:   # github_team_membership.members["admin:reinhud"] will be created
06:57:01.781 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
06:57:01.781 STDOUT [membership] tofu:       + etag     = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + id       = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + role     = "maintainer"
06:57:01.781 STDOUT [membership] tofu:       + team_id  = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + username = "reinhud"
06:57:01.781 STDOUT [membership] tofu:     }
06:57:01.781 STDOUT [membership] tofu:   # github_team_membership.members["ai:reinhud"] will be created
06:57:01.781 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
06:57:01.781 STDOUT [membership] tofu:       + etag     = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + id       = (known after apply)
06:57:01.781 STDOUT [membership] tofu:       + role     = "maintainer"
06:57:01.781 STDOUT [membership] tofu:       + team_id  = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + username = "reinhud"
06:57:01.782 STDOUT [membership] tofu:     }
06:57:01.782 STDOUT [membership] tofu:   # github_team_membership.members["app:reinhud"] will be created
06:57:01.782 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
06:57:01.782 STDOUT [membership] tofu:       + etag     = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + id       = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + role     = "maintainer"
06:57:01.782 STDOUT [membership] tofu:       + team_id  = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + username = "reinhud"
06:57:01.782 STDOUT [membership] tofu:     }
06:57:01.782 STDOUT [membership] tofu:   # github_team_membership.members["platform:reinhud"] will be created
06:57:01.782 STDOUT [membership] tofu:   + resource "github_team_membership" "members" {
06:57:01.782 STDOUT [membership] tofu:       + etag     = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + id       = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + role     = "maintainer"
06:57:01.782 STDOUT [membership] tofu:       + team_id  = (known after apply)
06:57:01.782 STDOUT [membership] tofu:       + username = "reinhud"
06:57:01.782 STDOUT [membership] tofu:     }
06:57:01.782 STDOUT [membership] tofu: Plan: 9 to add, 0 to change, 0 to destroy.
06:57:01.782 STDOUT [membership] tofu: Changes to Outputs:
06:57:01.782 STDOUT [membership] tofu:   + organization_members = {
06:57:01.782 STDOUT [membership] tofu:       + reinhud = {
06:57:01.782 STDOUT [membership] tofu:           + role     = "admin"
06:57:01.782 STDOUT [membership] tofu:           + username = "reinhud"
06:57:01.782 STDOUT [membership] tofu:         }
06:57:01.782 STDOUT [membership] tofu:     }
06:57:01.782 STDOUT [membership] tofu:   + team_memberships     = {
06:57:01.782 STDOUT [membership] tofu:       + "admin:reinhud"    = {
06:57:01.782 STDOUT [membership] tofu:           + role     = "maintainer"
06:57:01.783 STDOUT [membership] tofu:           + team_id  = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + username = "reinhud"
06:57:01.783 STDOUT [membership] tofu:         }
06:57:01.783 STDOUT [membership] tofu:       + "ai:reinhud"       = {
06:57:01.783 STDOUT [membership] tofu:           + role     = "maintainer"
06:57:01.783 STDOUT [membership] tofu:           + team_id  = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + username = "reinhud"
06:57:01.783 STDOUT [membership] tofu:         }
06:57:01.783 STDOUT [membership] tofu:       + "app:reinhud"      = {
06:57:01.783 STDOUT [membership] tofu:           + role     = "maintainer"
06:57:01.783 STDOUT [membership] tofu:           + team_id  = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + username = "reinhud"
06:57:01.783 STDOUT [membership] tofu:         }
06:57:01.783 STDOUT [membership] tofu:       + "platform:reinhud" = {
06:57:01.783 STDOUT [membership] tofu:           + role     = "maintainer"
06:57:01.783 STDOUT [membership] tofu:           + team_id  = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + username = "reinhud"
06:57:01.783 STDOUT [membership] tofu:         }
06:57:01.783 STDOUT [membership] tofu:     }
06:57:01.783 STDOUT [membership] tofu:   + teams                = {
06:57:01.783 STDOUT [membership] tofu:       + admin    = {
06:57:01.783 STDOUT [membership] tofu:           + description   = "Organization wide access, manages day to day organization management"
06:57:01.783 STDOUT [membership] tofu:           + id            = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + members_count = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + name          = "admin"
06:57:01.783 STDOUT [membership] tofu:           + node_id       = (known after apply)
06:57:01.783 STDOUT [membership] tofu:           + privacy       = "closed"
06:57:01.783 STDOUT [membership] tofu:           + slug          = (known after apply)
06:57:01.783 STDOUT [membership] tofu:         }
06:57:01.783 STDOUT [membership] tofu:       + ai       = {
06:57:01.784 STDOUT [membership] tofu:           + description   = "AI/ML engineering team"
06:57:01.784 STDOUT [membership] tofu:           + id            = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + members_count = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + name          = "ai"
06:57:01.784 STDOUT [membership] tofu:           + node_id       = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + privacy       = "closed"
06:57:01.784 STDOUT [membership] tofu:           + slug          = (known after apply)
06:57:01.784 STDOUT [membership] tofu:         }
06:57:01.784 STDOUT [membership] tofu:       + app      = {
06:57:01.784 STDOUT [membership] tofu:           + description   = "Application development team"
06:57:01.784 STDOUT [membership] tofu:           + id            = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + members_count = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + name          = "app"
06:57:01.784 STDOUT [membership] tofu:           + node_id       = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + privacy       = "closed"
06:57:01.784 STDOUT [membership] tofu:           + slug          = (known after apply)
06:57:01.784 STDOUT [membership] tofu:         }
06:57:01.784 STDOUT [membership] tofu:       + platform = {
06:57:01.784 STDOUT [membership] tofu:           + description   = "Platform engineering and infrastructure team"
06:57:01.784 STDOUT [membership] tofu:           + id            = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + members_count = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + name          = "platform"
06:57:01.784 STDOUT [membership] tofu:           + node_id       = (known after apply)
06:57:01.784 STDOUT [membership] tofu:           + privacy       = "closed"
06:57:01.784 STDOUT [membership] tofu:           + slug          = (known after apply)
06:57:01.784 STDOUT [membership] tofu:         }
06:57:01.784 STDOUT [membership] tofu:     }
06:57:01.838 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
06:57:02.321 STDOUT [repository] tofu: OpenTofu used the selected providers to generate the following execution
06:57:02.322 STDOUT [repository] tofu: plan. Resource actions are indicated with the following symbols:
06:57:02.322 STDOUT [repository] tofu:   + create
06:57:02.322 STDOUT [repository] tofu: OpenTofu will perform the following actions:
06:57:02.322 STDOUT [repository] tofu:   # github_issue_label.all[".github:bug"] will be created
06:57:02.322 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.322 STDOUT [repository] tofu:       + color       = "d73a4a"
06:57:02.322 STDOUT [repository] tofu:       + description = "Something isn't working"
06:57:02.322 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.322 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.322 STDOUT [repository] tofu:       + name        = "bug"
06:57:02.322 STDOUT [repository] tofu:       + repository  = ".github"
06:57:02.322 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.322 STDOUT [repository] tofu:     }
06:57:02.322 STDOUT [repository] tofu:   # github_issue_label.all[".github:stuff"] will be created
06:57:02.322 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.322 STDOUT [repository] tofu:       + color       = "a2eeef"
06:57:02.322 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
06:57:02.322 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.322 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.322 STDOUT [repository] tofu:       + name        = "stuff"
06:57:02.322 STDOUT [repository] tofu:       + repository  = ".github"
06:57:02.323 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.323 STDOUT [repository] tofu:     }
06:57:02.323 STDOUT [repository] tofu:   # github_issue_label.all["github-management:bug"] will be created
06:57:02.323 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.323 STDOUT [repository] tofu:       + color       = "d73a4a"
06:57:02.323 STDOUT [repository] tofu:       + description = "Something isn't working"
06:57:02.323 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.323 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.323 STDOUT [repository] tofu:       + name        = "bug"
06:57:02.323 STDOUT [repository] tofu:       + repository  = "github-management"
06:57:02.323 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.323 STDOUT [repository] tofu:     }
06:57:02.323 STDOUT [repository] tofu:   # github_issue_label.all["github-management:stuff"] will be created
06:57:02.323 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.323 STDOUT [repository] tofu:       + color       = "a2eeef"
06:57:02.323 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
06:57:02.323 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.323 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.323 STDOUT [repository] tofu:       + name        = "stuff"
06:57:02.323 STDOUT [repository] tofu:       + repository  = "github-management"
06:57:02.323 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.323 STDOUT [repository] tofu:     }
06:57:02.323 STDOUT [repository] tofu:   # github_issue_label.all["gitops:bug"] will be created
06:57:02.323 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.323 STDOUT [repository] tofu:       + color       = "d73a4a"
06:57:02.323 STDOUT [repository] tofu:       + description = "Something isn't working"
06:57:02.323 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.324 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.324 STDOUT [repository] tofu:       + name        = "bug"
06:57:02.324 STDOUT [repository] tofu:       + repository  = "gitops"
06:57:02.324 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.324 STDOUT [repository] tofu:     }
06:57:02.324 STDOUT [repository] tofu:   # github_issue_label.all["gitops:stuff"] will be created
06:57:02.324 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.324 STDOUT [repository] tofu:       + color       = "a2eeef"
06:57:02.324 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
06:57:02.324 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.324 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.324 STDOUT [repository] tofu:       + name        = "stuff"
06:57:02.324 STDOUT [repository] tofu:       + repository  = "gitops"
06:57:02.324 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.324 STDOUT [repository] tofu:     }
06:57:02.324 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:bug"] will be created
06:57:02.324 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.324 STDOUT [repository] tofu:       + color       = "d73a4a"
06:57:02.324 STDOUT [repository] tofu:       + description = "Something isn't working"
06:57:02.324 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.324 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.324 STDOUT [repository] tofu:       + name        = "bug"
06:57:02.324 STDOUT [repository] tofu:       + repository  = "infra-live"
06:57:02.324 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.324 STDOUT [repository] tofu:     }
06:57:02.324 STDOUT [repository] tofu:   # github_issue_label.all["infra-live:stuff"] will be created
06:57:02.324 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.324 STDOUT [repository] tofu:       + color       = "a2eeef"
06:57:02.325 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
06:57:02.325 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.325 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.325 STDOUT [repository] tofu:       + name        = "stuff"
06:57:02.325 STDOUT [repository] tofu:       + repository  = "infra-live"
06:57:02.325 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.325 STDOUT [repository] tofu:     }
06:57:02.325 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:bug"] will be created
06:57:02.325 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.325 STDOUT [repository] tofu:       + color       = "d73a4a"
06:57:02.325 STDOUT [repository] tofu:       + description = "Something isn't working"
06:57:02.325 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.325 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.325 STDOUT [repository] tofu:       + name        = "bug"
06:57:02.325 STDOUT [repository] tofu:       + repository  = "infra-modules"
06:57:02.325 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.325 STDOUT [repository] tofu:     }
06:57:02.325 STDOUT [repository] tofu:   # github_issue_label.all["infra-modules:stuff"] will be created
06:57:02.325 STDOUT [repository] tofu:   + resource "github_issue_label" "all" {
06:57:02.325 STDOUT [repository] tofu:       + color       = "a2eeef"
06:57:02.325 STDOUT [repository] tofu:       + description = "Stuff & Stuff"
06:57:02.325 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.325 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.325 STDOUT [repository] tofu:       + name        = "stuff"
06:57:02.325 STDOUT [repository] tofu:       + repository  = "infra-modules"
06:57:02.325 STDOUT [repository] tofu:       + url         = (known after apply)
06:57:02.325 STDOUT [repository] tofu:     }
06:57:02.325 STDOUT [repository] tofu:   # github_repository.all[".github"] will be created
06:57:02.326 STDOUT [repository] tofu:   + resource "github_repository" "all" {
06:57:02.326 STDOUT [repository] tofu:       + allow_auto_merge            = true
06:57:02.326 STDOUT [repository] tofu:       + allow_merge_commit          = true
06:57:02.326 STDOUT [repository] tofu:       + allow_rebase_merge          = true
06:57:02.326 STDOUT [repository] tofu:       + allow_squash_merge          = true
06:57:02.326 STDOUT [repository] tofu:       + allow_update_branch         = true
06:57:02.326 STDOUT [repository] tofu:       + archive_on_destroy          = false
06:57:02.326 STDOUT [repository] tofu:       + archived                    = false
06:57:02.326 STDOUT [repository] tofu:       + auto_init                   = true
06:57:02.326 STDOUT [repository] tofu:       + default_branch              = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
06:57:02.326 STDOUT [repository] tofu:       + description                 = "Organization-wide GitHub configurations, workflows, and community templates"
06:57:02.326 STDOUT [repository] tofu:       + etag                        = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + full_name                   = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + has_discussions             = true
06:57:02.326 STDOUT [repository] tofu:       + has_downloads               = false
06:57:02.326 STDOUT [repository] tofu:       + has_issues                  = true
06:57:02.326 STDOUT [repository] tofu:       + has_projects                = false
06:57:02.326 STDOUT [repository] tofu:       + has_wiki                    = true
06:57:02.326 STDOUT [repository] tofu:       + html_url                    = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + id                          = (known after apply)
06:57:02.326 STDOUT [repository] tofu:       + license_template            = "mit"
06:57:02.327 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
06:57:02.327 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
06:57:02.327 STDOUT [repository] tofu:       + name                        = ".github"
06:57:02.327 STDOUT [repository] tofu:       + node_id                     = (known after apply)
06:57:02.327 STDOUT [repository] tofu:       + primary_language            = (known after apply)
06:57:02.327 STDOUT [repository] tofu:       + private                     = (known after apply)
06:57:02.327 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
06:57:02.327 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
06:57:02.327 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
06:57:02.327 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
06:57:02.327 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
06:57:02.327 STDOUT [repository] tofu:       + topics                      = [
06:57:02.327 STDOUT [repository] tofu:           + "automation",
06:57:02.327 STDOUT [repository] tofu:           + "community",
06:57:02.327 STDOUT [repository] tofu:           + "github",
06:57:02.327 STDOUT [repository] tofu:           + "templates",
06:57:02.327 STDOUT [repository] tofu:           + "workflows",
06:57:02.327 STDOUT [repository] tofu:         ]
06:57:02.327 STDOUT [repository] tofu:       + visibility                  = "public"
06:57:02.327 STDOUT [repository] tofu:       + vulnerability_alerts        = true
06:57:02.327 STDOUT [repository] tofu:       + web_commit_signoff_required = false
06:57:02.327 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
06:57:02.327 STDOUT [repository] tofu:     }
06:57:02.327 STDOUT [repository] tofu:   # github_repository.all["github-management"] will be created
06:57:02.327 STDOUT [repository] tofu:   + resource "github_repository" "all" {
06:57:02.327 STDOUT [repository] tofu:       + allow_auto_merge            = false
06:57:02.328 STDOUT [repository] tofu:       + allow_merge_commit          = true
06:57:02.328 STDOUT [repository] tofu:       + allow_rebase_merge          = true
06:57:02.328 STDOUT [repository] tofu:       + allow_squash_merge          = true
06:57:02.328 STDOUT [repository] tofu:       + allow_update_branch         = true
06:57:02.328 STDOUT [repository] tofu:       + archive_on_destroy          = false
06:57:02.328 STDOUT [repository] tofu:       + archived                    = false
06:57:02.328 STDOUT [repository] tofu:       + auto_init                   = true
06:57:02.328 STDOUT [repository] tofu:       + default_branch              = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
06:57:02.328 STDOUT [repository] tofu:       + description                 = "Infrastructure as Code for GitHub organization, repositories, and security management"
06:57:02.328 STDOUT [repository] tofu:       + etag                        = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + full_name                   = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
06:57:02.328 STDOUT [repository] tofu:       + has_discussions             = false
06:57:02.328 STDOUT [repository] tofu:       + has_downloads               = false
06:57:02.328 STDOUT [repository] tofu:       + has_issues                  = true
06:57:02.328 STDOUT [repository] tofu:       + has_projects                = false
06:57:02.328 STDOUT [repository] tofu:       + has_wiki                    = false
06:57:02.328 STDOUT [repository] tofu:       + html_url                    = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + id                          = (known after apply)
06:57:02.328 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
06:57:02.329 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
06:57:02.329 STDOUT [repository] tofu:       + name                        = "github-management"
06:57:02.329 STDOUT [repository] tofu:       + node_id                     = (known after apply)
06:57:02.329 STDOUT [repository] tofu:       + primary_language            = (known after apply)
06:57:02.329 STDOUT [repository] tofu:       + private                     = (known after apply)
06:57:02.329 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
06:57:02.329 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
06:57:02.329 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
06:57:02.329 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
06:57:02.329 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
06:57:02.329 STDOUT [repository] tofu:       + topics                      = [
06:57:02.329 STDOUT [repository] tofu:           + "automation",
06:57:02.329 STDOUT [repository] tofu:           + "github",
06:57:02.329 STDOUT [repository] tofu:           + "infrastructure",
06:57:02.329 STDOUT [repository] tofu:           + "security",
06:57:02.329 STDOUT [repository] tofu:           + "terraform",
06:57:02.329 STDOUT [repository] tofu:         ]
06:57:02.329 STDOUT [repository] tofu:       + visibility                  = "public"
06:57:02.329 STDOUT [repository] tofu:       + vulnerability_alerts        = true
06:57:02.330 STDOUT [repository] tofu:       + web_commit_signoff_required = false
06:57:02.330 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
06:57:02.330 STDOUT [repository] tofu:     }
06:57:02.330 STDOUT [repository] tofu:   # github_repository.all["gitops"] will be created
06:57:02.330 STDOUT [repository] tofu:   + resource "github_repository" "all" {
06:57:02.330 STDOUT [repository] tofu:       + allow_auto_merge            = false
06:57:02.330 STDOUT [repository] tofu:       + allow_merge_commit          = true
06:57:02.330 STDOUT [repository] tofu:       + allow_rebase_merge          = true
06:57:02.330 STDOUT [repository] tofu:       + allow_squash_merge          = true
06:57:02.330 STDOUT [repository] tofu:       + allow_update_branch         = true
06:57:02.330 STDOUT [repository] tofu:       + archive_on_destroy          = false
06:57:02.330 STDOUT [repository] tofu:       + archived                    = false
06:57:02.330 STDOUT [repository] tofu:       + auto_init                   = true
06:57:02.330 STDOUT [repository] tofu:       + default_branch              = (known after apply)
06:57:02.330 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
06:57:02.330 STDOUT [repository] tofu:       + description                 = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"
06:57:02.330 STDOUT [repository] tofu:       + etag                        = (known after apply)
06:57:02.330 STDOUT [repository] tofu:       + full_name                   = (known after apply)
06:57:02.330 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
06:57:02.330 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
06:57:02.330 STDOUT [repository] tofu:       + has_discussions             = false
06:57:02.330 STDOUT [repository] tofu:       + has_downloads               = false
06:57:02.331 STDOUT [repository] tofu:       + has_issues                  = true
06:57:02.331 STDOUT [repository] tofu:       + has_projects                = false
06:57:02.331 STDOUT [repository] tofu:       + has_wiki                    = false
06:57:02.331 STDOUT [repository] tofu:       + html_url                    = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + id                          = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
06:57:02.331 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
06:57:02.331 STDOUT [repository] tofu:       + name                        = "gitops"
06:57:02.331 STDOUT [repository] tofu:       + node_id                     = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + primary_language            = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + private                     = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
06:57:02.331 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
06:57:02.331 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
06:57:02.331 STDOUT [repository] tofu:       + topics                      = [
06:57:02.331 STDOUT [repository] tofu:           + "argocd",
06:57:02.331 STDOUT [repository] tofu:           + "deployments",
06:57:02.331 STDOUT [repository] tofu:           + "gitops",
06:57:02.331 STDOUT [repository] tofu:           + "helm",
06:57:02.331 STDOUT [repository] tofu:           + "kubernetes",
06:57:02.331 STDOUT [repository] tofu:         ]
06:57:02.332 STDOUT [repository] tofu:       + visibility                  = "public"
06:57:02.332 STDOUT [repository] tofu:       + vulnerability_alerts        = true
06:57:02.332 STDOUT [repository] tofu:       + web_commit_signoff_required = false
06:57:02.332 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
06:57:02.332 STDOUT [repository] tofu:     }
06:57:02.332 STDOUT [repository] tofu:   # github_repository.all["infra-live"] will be created
06:57:02.332 STDOUT [repository] tofu:   + resource "github_repository" "all" {
06:57:02.332 STDOUT [repository] tofu:       + allow_auto_merge            = false
06:57:02.332 STDOUT [repository] tofu:       + allow_merge_commit          = true
06:57:02.332 STDOUT [repository] tofu:       + allow_rebase_merge          = true
06:57:02.332 STDOUT [repository] tofu:       + allow_squash_merge          = true
06:57:02.332 STDOUT [repository] tofu:       + allow_update_branch         = true
06:57:02.332 STDOUT [repository] tofu:       + archive_on_destroy          = false
06:57:02.332 STDOUT [repository] tofu:       + archived                    = false
06:57:02.332 STDOUT [repository] tofu:       + auto_init                   = true
06:57:02.332 STDOUT [repository] tofu:       + default_branch              = (known after apply)
06:57:02.332 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
06:57:02.332 STDOUT [repository] tofu:       + description                 = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"
06:57:02.332 STDOUT [repository] tofu:       + etag                        = (known after apply)
06:57:02.332 STDOUT [repository] tofu:       + full_name                   = (known after apply)
06:57:02.332 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
06:57:02.332 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
06:57:02.332 STDOUT [repository] tofu:       + has_discussions             = false
06:57:02.332 STDOUT [repository] tofu:       + has_downloads               = false
06:57:02.333 STDOUT [repository] tofu:       + has_issues                  = true
06:57:02.333 STDOUT [repository] tofu:       + has_projects                = false
06:57:02.333 STDOUT [repository] tofu:       + has_wiki                    = false
06:57:02.333 STDOUT [repository] tofu:       + html_url                    = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + id                          = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
06:57:02.333 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
06:57:02.333 STDOUT [repository] tofu:       + name                        = "infra-live"
06:57:02.333 STDOUT [repository] tofu:       + node_id                     = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + primary_language            = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + private                     = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
06:57:02.333 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
06:57:02.333 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
06:57:02.333 STDOUT [repository] tofu:       + topics                      = [
06:57:02.333 STDOUT [repository] tofu:           + "environments",
06:57:02.333 STDOUT [repository] tofu:           + "infrastructure",
06:57:02.333 STDOUT [repository] tofu:           + "production",
06:57:02.333 STDOUT [repository] tofu:           + "terraform",
06:57:02.333 STDOUT [repository] tofu:           + "terragrunt",
06:57:02.334 STDOUT [repository] tofu:         ]
06:57:02.334 STDOUT [repository] tofu:       + visibility                  = "public"
06:57:02.334 STDOUT [repository] tofu:       + vulnerability_alerts        = true
06:57:02.334 STDOUT [repository] tofu:       + web_commit_signoff_required = false
06:57:02.334 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
06:57:02.334 STDOUT [repository] tofu:     }
06:57:02.334 STDOUT [repository] tofu:   # github_repository.all["infra-modules"] will be created
06:57:02.334 STDOUT [repository] tofu:   + resource "github_repository" "all" {
06:57:02.334 STDOUT [repository] tofu:       + allow_auto_merge            = false
06:57:02.334 STDOUT [repository] tofu:       + allow_merge_commit          = true
06:57:02.334 STDOUT [repository] tofu:       + allow_rebase_merge          = true
06:57:02.334 STDOUT [repository] tofu:       + allow_squash_merge          = true
06:57:02.334 STDOUT [repository] tofu:       + allow_update_branch         = true
06:57:02.334 STDOUT [repository] tofu:       + archive_on_destroy          = false
06:57:02.334 STDOUT [repository] tofu:       + archived                    = false
06:57:02.334 STDOUT [repository] tofu:       + auto_init                   = true
06:57:02.334 STDOUT [repository] tofu:       + default_branch              = (known after apply)
06:57:02.334 STDOUT [repository] tofu:       + delete_branch_on_merge      = true
06:57:02.334 STDOUT [repository] tofu:       + description                 = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"
06:57:02.334 STDOUT [repository] tofu:       + etag                        = (known after apply)
06:57:02.334 STDOUT [repository] tofu:       + full_name                   = (known after apply)
06:57:02.334 STDOUT [repository] tofu:       + git_clone_url               = (known after apply)
06:57:02.334 STDOUT [repository] tofu:       + gitignore_template          = "Terraform"
06:57:02.334 STDOUT [repository] tofu:       + has_discussions             = false
06:57:02.335 STDOUT [repository] tofu:       + has_downloads               = false
06:57:02.335 STDOUT [repository] tofu:       + has_issues                  = true
06:57:02.335 STDOUT [repository] tofu:       + has_projects                = false
06:57:02.335 STDOUT [repository] tofu:       + has_wiki                    = false
06:57:02.335 STDOUT [repository] tofu:       + html_url                    = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + http_clone_url              = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + id                          = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + merge_commit_message        = "PR_TITLE"
06:57:02.335 STDOUT [repository] tofu:       + merge_commit_title          = "MERGE_MESSAGE"
06:57:02.335 STDOUT [repository] tofu:       + name                        = "infra-modules"
06:57:02.335 STDOUT [repository] tofu:       + node_id                     = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + primary_language            = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + private                     = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + repo_id                     = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + squash_merge_commit_message = "PR_BODY"
06:57:02.335 STDOUT [repository] tofu:       + squash_merge_commit_title   = "PR_TITLE"
06:57:02.335 STDOUT [repository] tofu:       + ssh_clone_url               = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + svn_url                     = (known after apply)
06:57:02.335 STDOUT [repository] tofu:       + topics                      = [
06:57:02.335 STDOUT [repository] tofu:           + "cloud",
06:57:02.335 STDOUT [repository] tofu:           + "infrastructure",
06:57:02.335 STDOUT [repository] tofu:           + "kubernetes",
06:57:02.335 STDOUT [repository] tofu:           + "modules",
06:57:02.336 STDOUT [repository] tofu:           + "terraform",
06:57:02.336 STDOUT [repository] tofu:         ]
06:57:02.336 STDOUT [repository] tofu:       + visibility                  = "public"
06:57:02.336 STDOUT [repository] tofu:       + vulnerability_alerts        = true
06:57:02.336 STDOUT [repository] tofu:       + web_commit_signoff_required = false
06:57:02.336 STDOUT [repository] tofu:       + security_and_analysis (known after apply)
06:57:02.336 STDOUT [repository] tofu:     }
06:57:02.336 STDOUT [repository] tofu:   # github_repository_milestone.all[".github:Phase 1: Milestone 1"] will be created
06:57:02.336 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
06:57:02.336 STDOUT [repository] tofu:       + description = "Milestone 1"
06:57:02.336 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
06:57:02.336 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.336 STDOUT [repository] tofu:       + number      = (known after apply)
06:57:02.336 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
06:57:02.336 STDOUT [repository] tofu:       + repository  = ".github"
06:57:02.336 STDOUT [repository] tofu:       + state       = "open"
06:57:02.336 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
06:57:02.336 STDOUT [repository] tofu:     }
06:57:02.336 STDOUT [repository] tofu:   # github_repository_milestone.all["github-management:Phase 1: Milestone 1"] will be created
06:57:02.336 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
06:57:02.336 STDOUT [repository] tofu:       + description = "Milestone 1"
06:57:02.336 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
06:57:02.336 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.336 STDOUT [repository] tofu:       + number      = (known after apply)
06:57:02.336 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
06:57:02.336 STDOUT [repository] tofu:       + repository  = "github-management"
06:57:02.337 STDOUT [repository] tofu:       + state       = "open"
06:57:02.337 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
06:57:02.337 STDOUT [repository] tofu:     }
06:57:02.337 STDOUT [repository] tofu:   # github_repository_milestone.all["gitops:Phase 1: Milestone 1"] will be created
06:57:02.337 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
06:57:02.337 STDOUT [repository] tofu:       + description = "Milestone 1"
06:57:02.337 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
06:57:02.337 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.337 STDOUT [repository] tofu:       + number      = (known after apply)
06:57:02.337 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
06:57:02.337 STDOUT [repository] tofu:       + repository  = "gitops"
06:57:02.337 STDOUT [repository] tofu:       + state       = "open"
06:57:02.337 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
06:57:02.337 STDOUT [repository] tofu:     }
06:57:02.337 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-live:Phase 1: Milestone 1"] will be created
06:57:02.337 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
06:57:02.337 STDOUT [repository] tofu:       + description = "Milestone 1"
06:57:02.337 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
06:57:02.337 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.337 STDOUT [repository] tofu:       + number      = (known after apply)
06:57:02.337 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
06:57:02.337 STDOUT [repository] tofu:       + repository  = "infra-live"
06:57:02.337 STDOUT [repository] tofu:       + state       = "open"
06:57:02.338 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
06:57:02.338 STDOUT [repository] tofu:     }
06:57:02.338 STDOUT [repository] tofu:   # github_repository_milestone.all["infra-modules:Phase 1: Milestone 1"] will be created
06:57:02.338 STDOUT [repository] tofu:   + resource "github_repository_milestone" "all" {
06:57:02.338 STDOUT [repository] tofu:       + description = "Milestone 1"
06:57:02.338 STDOUT [repository] tofu:       + due_date    = "2025-09-01"
06:57:02.338 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.338 STDOUT [repository] tofu:       + number      = (known after apply)
06:57:02.338 STDOUT [repository] tofu:       + owner       = "exploring-gh-organizations"
06:57:02.338 STDOUT [repository] tofu:       + repository  = "infra-modules"
06:57:02.338 STDOUT [repository] tofu:       + state       = "open"
06:57:02.338 STDOUT [repository] tofu:       + title       = "Phase 1: Milestone 1"
06:57:02.338 STDOUT [repository] tofu:     }
06:57:02.338 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets[".github:public-security"] will be created
06:57:02.338 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
06:57:02.338 STDOUT [repository] tofu:       + enforcement = "active"
06:57:02.338 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.338 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.338 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
06:57:02.338 STDOUT [repository] tofu:       + node_id     = (known after apply)
06:57:02.338 STDOUT [repository] tofu:       + repository  = ".github"
06:57:02.338 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
06:57:02.338 STDOUT [repository] tofu:       + target      = "branch"
06:57:02.338 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.338 STDOUT [repository] tofu:           + actor_id    = 1
06:57:02.339 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
06:57:02.339 STDOUT [repository] tofu:           + bypass_mode = "always"
06:57:02.339 STDOUT [repository] tofu:         }
06:57:02.339 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.339 STDOUT [repository] tofu:           + actor_id    = 5
06:57:02.339 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
06:57:02.339 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
06:57:02.339 STDOUT [repository] tofu:         }
06:57:02.339 STDOUT [repository] tofu:       + conditions {
06:57:02.339 STDOUT [repository] tofu:           + ref_name {
06:57:02.339 STDOUT [repository] tofu:               + exclude = []
06:57:02.339 STDOUT [repository] tofu:               + include = [
06:57:02.339 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
06:57:02.339 STDOUT [repository] tofu:                 ]
06:57:02.339 STDOUT [repository] tofu:             }
06:57:02.339 STDOUT [repository] tofu:         }
06:57:02.339 STDOUT [repository] tofu:       + rules {
06:57:02.339 STDOUT [repository] tofu:           + creation                      = true
06:57:02.339 STDOUT [repository] tofu:           + deletion                      = true
06:57:02.339 STDOUT [repository] tofu:           + non_fast_forward              = true
06:57:02.339 STDOUT [repository] tofu:           + required_linear_history       = true
06:57:02.339 STDOUT [repository] tofu:           + required_signatures           = true
06:57:02.339 STDOUT [repository] tofu:           + update                        = true
06:57:02.339 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
06:57:02.339 STDOUT [repository] tofu:           + branch_name_pattern {
06:57:02.339 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
06:57:02.339 STDOUT [repository] tofu:               + negate   = true
06:57:02.339 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.339 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
06:57:02.340 STDOUT [repository] tofu:             }
06:57:02.340 STDOUT [repository] tofu:           + commit_message_pattern {
06:57:02.340 STDOUT [repository] tofu:               + name     = "Conventional Commits"
06:57:02.340 STDOUT [repository] tofu:               + negate   = false
06:57:02.340 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.340 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
06:57:02.340 STDOUT [repository] tofu:             }
06:57:02.340 STDOUT [repository] tofu:           + merge_queue {
06:57:02.340 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
06:57:02.340 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
06:57:02.340 STDOUT [repository] tofu:               + max_entries_to_build              = 5
06:57:02.340 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
06:57:02.340 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
06:57:02.340 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
06:57:02.340 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
06:57:02.340 STDOUT [repository] tofu:             }
06:57:02.340 STDOUT [repository] tofu:           + pull_request {
06:57:02.340 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
06:57:02.340 STDOUT [repository] tofu:               + require_code_owner_review         = true
06:57:02.340 STDOUT [repository] tofu:               + require_last_push_approval        = true
06:57:02.340 STDOUT [repository] tofu:               + required_approving_review_count   = 2
06:57:02.340 STDOUT [repository] tofu:               + required_review_thread_resolution = true
06:57:02.340 STDOUT [repository] tofu:             }
06:57:02.341 STDOUT [repository] tofu:           + required_code_scanning {
06:57:02.341 STDOUT [repository] tofu:               + required_code_scanning_tool {
06:57:02.341 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
06:57:02.341 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
06:57:02.341 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
06:57:02.341 STDOUT [repository] tofu:                 }
06:57:02.341 STDOUT [repository] tofu:             }
06:57:02.341 STDOUT [repository] tofu:           + required_status_checks {
06:57:02.341 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
06:57:02.341 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
06:57:02.341 STDOUT [repository] tofu:               + required_check {
06:57:02.341 STDOUT [repository] tofu:                   + context        = "Code Quality"
06:57:02.341 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.341 STDOUT [repository] tofu:                 }
06:57:02.341 STDOUT [repository] tofu:               + required_check {
06:57:02.341 STDOUT [repository] tofu:                   + context        = "Security Scan"
06:57:02.341 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.341 STDOUT [repository] tofu:                 }
06:57:02.341 STDOUT [repository] tofu:               + required_check {
06:57:02.341 STDOUT [repository] tofu:                   + context        = "Tests"
06:57:02.341 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.341 STDOUT [repository] tofu:                 }
06:57:02.341 STDOUT [repository] tofu:             }
06:57:02.341 STDOUT [repository] tofu:         }
06:57:02.341 STDOUT [repository] tofu:     }
06:57:02.341 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["github-management:public-security"] will be created
06:57:02.342 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
06:57:02.342 STDOUT [repository] tofu:       + enforcement = "active"
06:57:02.342 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.342 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.342 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
06:57:02.342 STDOUT [repository] tofu:       + node_id     = (known after apply)
06:57:02.342 STDOUT [repository] tofu:       + repository  = "github-management"
06:57:02.342 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
06:57:02.342 STDOUT [repository] tofu:       + target      = "branch"
06:57:02.342 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.342 STDOUT [repository] tofu:           + actor_id    = 1
06:57:02.342 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
06:57:02.342 STDOUT [repository] tofu:           + bypass_mode = "always"
06:57:02.342 STDOUT [repository] tofu:         }
06:57:02.342 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.342 STDOUT [repository] tofu:           + actor_id    = 5
06:57:02.342 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
06:57:02.342 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
06:57:02.342 STDOUT [repository] tofu:         }
06:57:02.342 STDOUT [repository] tofu:       + conditions {
06:57:02.342 STDOUT [repository] tofu:           + ref_name {
06:57:02.342 STDOUT [repository] tofu:               + exclude = []
06:57:02.342 STDOUT [repository] tofu:               + include = [
06:57:02.342 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
06:57:02.342 STDOUT [repository] tofu:                 ]
06:57:02.342 STDOUT [repository] tofu:             }
06:57:02.342 STDOUT [repository] tofu:         }
06:57:02.342 STDOUT [repository] tofu:       + rules {
06:57:02.342 STDOUT [repository] tofu:           + creation                      = true
06:57:02.343 STDOUT [repository] tofu:           + deletion                      = true
06:57:02.343 STDOUT [repository] tofu:           + non_fast_forward              = true
06:57:02.343 STDOUT [repository] tofu:           + required_linear_history       = true
06:57:02.343 STDOUT [repository] tofu:           + required_signatures           = true
06:57:02.343 STDOUT [repository] tofu:           + update                        = true
06:57:02.343 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
06:57:02.343 STDOUT [repository] tofu:           + branch_name_pattern {
06:57:02.343 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
06:57:02.343 STDOUT [repository] tofu:               + negate   = true
06:57:02.343 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.343 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
06:57:02.343 STDOUT [repository] tofu:             }
06:57:02.343 STDOUT [repository] tofu:           + commit_message_pattern {
06:57:02.343 STDOUT [repository] tofu:               + name     = "Conventional Commits"
06:57:02.343 STDOUT [repository] tofu:               + negate   = false
06:57:02.343 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.343 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
06:57:02.343 STDOUT [repository] tofu:             }
06:57:02.343 STDOUT [repository] tofu:           + merge_queue {
06:57:02.343 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
06:57:02.343 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
06:57:02.343 STDOUT [repository] tofu:               + max_entries_to_build              = 5
06:57:02.343 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
06:57:02.344 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
06:57:02.344 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
06:57:02.344 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
06:57:02.344 STDOUT [repository] tofu:             }
06:57:02.344 STDOUT [repository] tofu:           + pull_request {
06:57:02.344 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
06:57:02.344 STDOUT [repository] tofu:               + require_code_owner_review         = true
06:57:02.344 STDOUT [repository] tofu:               + require_last_push_approval        = true
06:57:02.344 STDOUT [repository] tofu:               + required_approving_review_count   = 2
06:57:02.344 STDOUT [repository] tofu:               + required_review_thread_resolution = true
06:57:02.344 STDOUT [repository] tofu:             }
06:57:02.344 STDOUT [repository] tofu:           + required_code_scanning {
06:57:02.344 STDOUT [repository] tofu:               + required_code_scanning_tool {
06:57:02.344 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
06:57:02.344 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
06:57:02.344 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
06:57:02.344 STDOUT [repository] tofu:                 }
06:57:02.344 STDOUT [repository] tofu:             }
06:57:02.344 STDOUT [repository] tofu:           + required_status_checks {
06:57:02.344 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
06:57:02.344 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
06:57:02.344 STDOUT [repository] tofu:               + required_check {
06:57:02.345 STDOUT [repository] tofu:                   + context        = "Code Quality"
06:57:02.345 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.345 STDOUT [repository] tofu:                 }
06:57:02.345 STDOUT [repository] tofu:               + required_check {
06:57:02.345 STDOUT [repository] tofu:                   + context        = "Security Scan"
06:57:02.345 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.345 STDOUT [repository] tofu:                 }
06:57:02.345 STDOUT [repository] tofu:               + required_check {
06:57:02.345 STDOUT [repository] tofu:                   + context        = "Tests"
06:57:02.345 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.345 STDOUT [repository] tofu:                 }
06:57:02.345 STDOUT [repository] tofu:             }
06:57:02.345 STDOUT [repository] tofu:         }
06:57:02.345 STDOUT [repository] tofu:     }
06:57:02.345 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["gitops:public-security"] will be created
06:57:02.345 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
06:57:02.345 STDOUT [repository] tofu:       + enforcement = "active"
06:57:02.345 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.345 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.345 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
06:57:02.345 STDOUT [repository] tofu:       + node_id     = (known after apply)
06:57:02.345 STDOUT [repository] tofu:       + repository  = "gitops"
06:57:02.345 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
06:57:02.345 STDOUT [repository] tofu:       + target      = "branch"
06:57:02.345 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.345 STDOUT [repository] tofu:           + actor_id    = 1
06:57:02.345 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
06:57:02.345 STDOUT [repository] tofu:           + bypass_mode = "always"
06:57:02.345 STDOUT [repository] tofu:         }
06:57:02.346 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.346 STDOUT [repository] tofu:           + actor_id    = 5
06:57:02.346 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
06:57:02.346 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
06:57:02.346 STDOUT [repository] tofu:         }
06:57:02.346 STDOUT [repository] tofu:       + conditions {
06:57:02.346 STDOUT [repository] tofu:           + ref_name {
06:57:02.346 STDOUT [repository] tofu:               + exclude = []
06:57:02.346 STDOUT [repository] tofu:               + include = [
06:57:02.346 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
06:57:02.346 STDOUT [repository] tofu:                 ]
06:57:02.346 STDOUT [repository] tofu:             }
06:57:02.346 STDOUT [repository] tofu:         }
06:57:02.346 STDOUT [repository] tofu:       + rules {
06:57:02.346 STDOUT [repository] tofu:           + creation                      = true
06:57:02.346 STDOUT [repository] tofu:           + deletion                      = true
06:57:02.346 STDOUT [repository] tofu:           + non_fast_forward              = true
06:57:02.346 STDOUT [repository] tofu:           + required_linear_history       = true
06:57:02.346 STDOUT [repository] tofu:           + required_signatures           = true
06:57:02.346 STDOUT [repository] tofu:           + update                        = true
06:57:02.346 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
06:57:02.346 STDOUT [repository] tofu:           + branch_name_pattern {
06:57:02.346 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
06:57:02.346 STDOUT [repository] tofu:               + negate   = true
06:57:02.346 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.346 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
06:57:02.346 STDOUT [repository] tofu:             }
06:57:02.346 STDOUT [repository] tofu:           + commit_message_pattern {
06:57:02.346 STDOUT [repository] tofu:               + name     = "Conventional Commits"
06:57:02.347 STDOUT [repository] tofu:               + negate   = false
06:57:02.347 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.347 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
06:57:02.347 STDOUT [repository] tofu:             }
06:57:02.347 STDOUT [repository] tofu:           + merge_queue {
06:57:02.347 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
06:57:02.347 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
06:57:02.347 STDOUT [repository] tofu:               + max_entries_to_build              = 5
06:57:02.347 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
06:57:02.347 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
06:57:02.347 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
06:57:02.347 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
06:57:02.347 STDOUT [repository] tofu:             }
06:57:02.347 STDOUT [repository] tofu:           + pull_request {
06:57:02.347 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
06:57:02.347 STDOUT [repository] tofu:               + require_code_owner_review         = true
06:57:02.347 STDOUT [repository] tofu:               + require_last_push_approval        = true
06:57:02.347 STDOUT [repository] tofu:               + required_approving_review_count   = 2
06:57:02.347 STDOUT [repository] tofu:               + required_review_thread_resolution = true
06:57:02.347 STDOUT [repository] tofu:             }
06:57:02.347 STDOUT [repository] tofu:           + required_code_scanning {
06:57:02.347 STDOUT [repository] tofu:               + required_code_scanning_tool {
06:57:02.347 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
06:57:02.348 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
06:57:02.348 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
06:57:02.348 STDOUT [repository] tofu:                 }
06:57:02.348 STDOUT [repository] tofu:             }
06:57:02.348 STDOUT [repository] tofu:           + required_status_checks {
06:57:02.348 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
06:57:02.348 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
06:57:02.348 STDOUT [repository] tofu:               + required_check {
06:57:02.348 STDOUT [repository] tofu:                   + context        = "Code Quality"
06:57:02.348 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.348 STDOUT [repository] tofu:                 }
06:57:02.348 STDOUT [repository] tofu:               + required_check {
06:57:02.348 STDOUT [repository] tofu:                   + context        = "Security Scan"
06:57:02.348 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.348 STDOUT [repository] tofu:                 }
06:57:02.348 STDOUT [repository] tofu:               + required_check {
06:57:02.348 STDOUT [repository] tofu:                   + context        = "Tests"
06:57:02.348 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.348 STDOUT [repository] tofu:                 }
06:57:02.348 STDOUT [repository] tofu:             }
06:57:02.348 STDOUT [repository] tofu:         }
06:57:02.348 STDOUT [repository] tofu:     }
06:57:02.348 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-live:public-security"] will be created
06:57:02.348 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
06:57:02.349 STDOUT [repository] tofu:       + enforcement = "active"
06:57:02.349 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.349 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.349 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
06:57:02.349 STDOUT [repository] tofu:       + node_id     = (known after apply)
06:57:02.349 STDOUT [repository] tofu:       + repository  = "infra-live"
06:57:02.349 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
06:57:02.349 STDOUT [repository] tofu:       + target      = "branch"
06:57:02.349 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.349 STDOUT [repository] tofu:           + actor_id    = 1
06:57:02.349 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
06:57:02.349 STDOUT [repository] tofu:           + bypass_mode = "always"
06:57:02.349 STDOUT [repository] tofu:         }
06:57:02.349 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.349 STDOUT [repository] tofu:           + actor_id    = 5
06:57:02.349 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
06:57:02.349 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
06:57:02.349 STDOUT [repository] tofu:         }
06:57:02.349 STDOUT [repository] tofu:       + conditions {
06:57:02.349 STDOUT [repository] tofu:           + ref_name {
06:57:02.349 STDOUT [repository] tofu:               + exclude = []
06:57:02.349 STDOUT [repository] tofu:               + include = [
06:57:02.349 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
06:57:02.349 STDOUT [repository] tofu:                 ]
06:57:02.349 STDOUT [repository] tofu:             }
06:57:02.349 STDOUT [repository] tofu:         }
06:57:02.349 STDOUT [repository] tofu:       + rules {
06:57:02.349 STDOUT [repository] tofu:           + creation                      = true
06:57:02.349 STDOUT [repository] tofu:           + deletion                      = true
06:57:02.349 STDOUT [repository] tofu:           + non_fast_forward              = true
06:57:02.350 STDOUT [repository] tofu:           + required_linear_history       = true
06:57:02.350 STDOUT [repository] tofu:           + required_signatures           = true
06:57:02.350 STDOUT [repository] tofu:           + update                        = true
06:57:02.350 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
06:57:02.350 STDOUT [repository] tofu:           + branch_name_pattern {
06:57:02.350 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
06:57:02.350 STDOUT [repository] tofu:               + negate   = true
06:57:02.350 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.350 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
06:57:02.350 STDOUT [repository] tofu:             }
06:57:02.350 STDOUT [repository] tofu:           + commit_message_pattern {
06:57:02.350 STDOUT [repository] tofu:               + name     = "Conventional Commits"
06:57:02.350 STDOUT [repository] tofu:               + negate   = false
06:57:02.350 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.350 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
06:57:02.350 STDOUT [repository] tofu:             }
06:57:02.350 STDOUT [repository] tofu:           + merge_queue {
06:57:02.350 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
06:57:02.350 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
06:57:02.350 STDOUT [repository] tofu:               + max_entries_to_build              = 5
06:57:02.350 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
06:57:02.350 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
06:57:02.350 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
06:57:02.350 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
06:57:02.351 STDOUT [repository] tofu:             }
06:57:02.351 STDOUT [repository] tofu:           + pull_request {
06:57:02.351 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
06:57:02.351 STDOUT [repository] tofu:               + require_code_owner_review         = true
06:57:02.351 STDOUT [repository] tofu:               + require_last_push_approval        = true
06:57:02.351 STDOUT [repository] tofu:               + required_approving_review_count   = 2
06:57:02.351 STDOUT [repository] tofu:               + required_review_thread_resolution = true
06:57:02.351 STDOUT [repository] tofu:             }
06:57:02.351 STDOUT [repository] tofu:           + required_code_scanning {
06:57:02.351 STDOUT [repository] tofu:               + required_code_scanning_tool {
06:57:02.351 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
06:57:02.351 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
06:57:02.351 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
06:57:02.351 STDOUT [repository] tofu:                 }
06:57:02.351 STDOUT [repository] tofu:             }
06:57:02.351 STDOUT [repository] tofu:           + required_status_checks {
06:57:02.351 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
06:57:02.351 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
06:57:02.351 STDOUT [repository] tofu:               + required_check {
06:57:02.351 STDOUT [repository] tofu:                   + context        = "Code Quality"
06:57:02.351 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.351 STDOUT [repository] tofu:                 }
06:57:02.351 STDOUT [repository] tofu:               + required_check {
06:57:02.351 STDOUT [repository] tofu:                   + context        = "Security Scan"
06:57:02.351 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.352 STDOUT [repository] tofu:                 }
06:57:02.352 STDOUT [repository] tofu:               + required_check {
06:57:02.352 STDOUT [repository] tofu:                   + context        = "Tests"
06:57:02.352 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.352 STDOUT [repository] tofu:                 }
06:57:02.352 STDOUT [repository] tofu:             }
06:57:02.352 STDOUT [repository] tofu:         }
06:57:02.352 STDOUT [repository] tofu:     }
06:57:02.352 STDOUT [repository] tofu:   # github_repository_ruleset.repo_rulesets["infra-modules:public-security"] will be created
06:57:02.352 STDOUT [repository] tofu:   + resource "github_repository_ruleset" "repo_rulesets" {
06:57:02.352 STDOUT [repository] tofu:       + enforcement = "active"
06:57:02.352 STDOUT [repository] tofu:       + etag        = (known after apply)
06:57:02.352 STDOUT [repository] tofu:       + id          = (known after apply)
06:57:02.352 STDOUT [repository] tofu:       + name        = "Maximum Security Protection PUBLIC REPOS"
06:57:02.352 STDOUT [repository] tofu:       + node_id     = (known after apply)
06:57:02.352 STDOUT [repository] tofu:       + repository  = "infra-modules"
06:57:02.352 STDOUT [repository] tofu:       + ruleset_id  = (known after apply)
06:57:02.352 STDOUT [repository] tofu:       + target      = "branch"
06:57:02.352 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.352 STDOUT [repository] tofu:           + actor_id    = 1
06:57:02.352 STDOUT [repository] tofu:           + actor_type  = "OrganizationAdmin"
06:57:02.352 STDOUT [repository] tofu:           + bypass_mode = "always"
06:57:02.352 STDOUT [repository] tofu:         }
06:57:02.352 STDOUT [repository] tofu:       + bypass_actors {
06:57:02.352 STDOUT [repository] tofu:           + actor_id    = 5
06:57:02.352 STDOUT [repository] tofu:           + actor_type  = "RepositoryRole"
06:57:02.352 STDOUT [repository] tofu:           + bypass_mode = "pull_request"
06:57:02.352 STDOUT [repository] tofu:         }
06:57:02.352 STDOUT [repository] tofu:       + conditions {
06:57:02.353 STDOUT [repository] tofu:           + ref_name {
06:57:02.353 STDOUT [repository] tofu:               + exclude = []
06:57:02.353 STDOUT [repository] tofu:               + include = [
06:57:02.353 STDOUT [repository] tofu:                   + "~DEFAULT_BRANCH",
06:57:02.353 STDOUT [repository] tofu:                 ]
06:57:02.353 STDOUT [repository] tofu:             }
06:57:02.353 STDOUT [repository] tofu:         }
06:57:02.353 STDOUT [repository] tofu:       + rules {
06:57:02.353 STDOUT [repository] tofu:           + creation                      = true
06:57:02.353 STDOUT [repository] tofu:           + deletion                      = true
06:57:02.353 STDOUT [repository] tofu:           + non_fast_forward              = true
06:57:02.353 STDOUT [repository] tofu:           + required_linear_history       = true
06:57:02.353 STDOUT [repository] tofu:           + required_signatures           = true
06:57:02.353 STDOUT [repository] tofu:           + update                        = true
06:57:02.353 STDOUT [repository] tofu:           + update_allows_fetch_and_merge = false
06:57:02.353 STDOUT [repository] tofu:           + branch_name_pattern {
06:57:02.353 STDOUT [repository] tofu:               + name     = "Valid Branch Names"
06:57:02.353 STDOUT [repository] tofu:               + negate   = true
06:57:02.353 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.353 STDOUT [repository] tofu:               + pattern  = "^(main|develop|feature/.+|fix/.+|hotfix/.+|release/.+)$"
06:57:02.353 STDOUT [repository] tofu:             }
06:57:02.353 STDOUT [repository] tofu:           + commit_message_pattern {
06:57:02.353 STDOUT [repository] tofu:               + name     = "Conventional Commits"
06:57:02.353 STDOUT [repository] tofu:               + negate   = false
06:57:02.353 STDOUT [repository] tofu:               + operator = "regex"
06:57:02.353 STDOUT [repository] tofu:               + pattern  = "^(feat|fix|docs|style|refactor|perf|test|chore)(\\(.+\\))?: .+"
06:57:02.353 STDOUT [repository] tofu:             }
06:57:02.354 STDOUT [repository] tofu:           + merge_queue {
06:57:02.354 STDOUT [repository] tofu:               + check_response_timeout_minutes    = 60
06:57:02.354 STDOUT [repository] tofu:               + grouping_strategy                 = "ALLGREEN"
06:57:02.354 STDOUT [repository] tofu:               + max_entries_to_build              = 5
06:57:02.354 STDOUT [repository] tofu:               + max_entries_to_merge              = 5
06:57:02.354 STDOUT [repository] tofu:               + merge_method                      = "SQUASH"
06:57:02.354 STDOUT [repository] tofu:               + min_entries_to_merge              = 1
06:57:02.354 STDOUT [repository] tofu:               + min_entries_to_merge_wait_minutes = 5
06:57:02.354 STDOUT [repository] tofu:             }
06:57:02.354 STDOUT [repository] tofu:           + pull_request {
06:57:02.354 STDOUT [repository] tofu:               + dismiss_stale_reviews_on_push     = true
06:57:02.354 STDOUT [repository] tofu:               + require_code_owner_review         = true
06:57:02.354 STDOUT [repository] tofu:               + require_last_push_approval        = true
06:57:02.354 STDOUT [repository] tofu:               + required_approving_review_count   = 2
06:57:02.354 STDOUT [repository] tofu:               + required_review_thread_resolution = true
06:57:02.354 STDOUT [repository] tofu:             }
06:57:02.354 STDOUT [repository] tofu:           + required_code_scanning {
06:57:02.354 STDOUT [repository] tofu:               + required_code_scanning_tool {
06:57:02.354 STDOUT [repository] tofu:                   + alerts_threshold          = "errors_and_warnings"
06:57:02.354 STDOUT [repository] tofu:                   + security_alerts_threshold = "high_or_higher"
06:57:02.354 STDOUT [repository] tofu:                   + tool                      = "CodeQL"
06:57:02.354 STDOUT [repository] tofu:                 }
06:57:02.354 STDOUT [repository] tofu:             }
06:57:02.355 STDOUT [repository] tofu:           + required_status_checks {
06:57:02.355 STDOUT [repository] tofu:               + do_not_enforce_on_create             = false
06:57:02.355 STDOUT [repository] tofu:               + strict_required_status_checks_policy = true
06:57:02.355 STDOUT [repository] tofu:               + required_check {
06:57:02.355 STDOUT [repository] tofu:                   + context        = "Code Quality"
06:57:02.355 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.355 STDOUT [repository] tofu:                 }
06:57:02.355 STDOUT [repository] tofu:               + required_check {
06:57:02.355 STDOUT [repository] tofu:                   + context        = "Security Scan"
06:57:02.355 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.355 STDOUT [repository] tofu:                 }
06:57:02.355 STDOUT [repository] tofu:               + required_check {
06:57:02.355 STDOUT [repository] tofu:                   + context        = "Tests"
06:57:02.355 STDOUT [repository] tofu:                   + integration_id = 0
06:57:02.355 STDOUT [repository] tofu:                 }
06:57:02.355 STDOUT [repository] tofu:             }
06:57:02.355 STDOUT [repository] tofu:         }
06:57:02.355 STDOUT [repository] tofu:     }
06:57:02.355 STDOUT [repository] tofu: Plan: 25 to add, 0 to change, 0 to destroy.
06:57:02.355 STDOUT [repository] tofu: Changes to Outputs:
06:57:02.355 STDOUT [repository] tofu:   + collaborators = {}
06:57:02.355 STDOUT [repository] tofu:   + labels        = {
06:57:02.355 STDOUT [repository] tofu:       + ".github:bug"             = {
06:57:02.355 STDOUT [repository] tofu:           + color       = "d73a4a"
06:57:02.355 STDOUT [repository] tofu:           + description = "Something isn't working"
06:57:02.355 STDOUT [repository] tofu:           + name        = "bug"
06:57:02.355 STDOUT [repository] tofu:           + repository  = ".github"
06:57:02.355 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.355 STDOUT [repository] tofu:         }
06:57:02.355 STDOUT [repository] tofu:       + ".github:stuff"           = {
06:57:02.356 STDOUT [repository] tofu:           + color       = "a2eeef"
06:57:02.356 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
06:57:02.356 STDOUT [repository] tofu:           + name        = "stuff"
06:57:02.356 STDOUT [repository] tofu:           + repository  = ".github"
06:57:02.356 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.356 STDOUT [repository] tofu:         }
06:57:02.356 STDOUT [repository] tofu:       + "github-management:bug"   = {
06:57:02.356 STDOUT [repository] tofu:           + color       = "d73a4a"
06:57:02.356 STDOUT [repository] tofu:           + description = "Something isn't working"
06:57:02.356 STDOUT [repository] tofu:           + name        = "bug"
06:57:02.356 STDOUT [repository] tofu:           + repository  = "github-management"
06:57:02.356 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.356 STDOUT [repository] tofu:         }
06:57:02.356 STDOUT [repository] tofu:       + "github-management:stuff" = {
06:57:02.356 STDOUT [repository] tofu:           + color       = "a2eeef"
06:57:02.356 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
06:57:02.356 STDOUT [repository] tofu:           + name        = "stuff"
06:57:02.356 STDOUT [repository] tofu:           + repository  = "github-management"
06:57:02.356 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.356 STDOUT [repository] tofu:         }
06:57:02.356 STDOUT [repository] tofu:       + "gitops:bug"              = {
06:57:02.356 STDOUT [repository] tofu:           + color       = "d73a4a"
06:57:02.356 STDOUT [repository] tofu:           + description = "Something isn't working"
06:57:02.356 STDOUT [repository] tofu:           + name        = "bug"
06:57:02.356 STDOUT [repository] tofu:           + repository  = "gitops"
06:57:02.356 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.356 STDOUT [repository] tofu:         }
06:57:02.356 STDOUT [repository] tofu:       + "gitops:stuff"            = {
06:57:02.356 STDOUT [repository] tofu:           + color       = "a2eeef"
06:57:02.356 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
06:57:02.356 STDOUT [repository] tofu:           + name        = "stuff"
06:57:02.357 STDOUT [repository] tofu:           + repository  = "gitops"
06:57:02.357 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.357 STDOUT [repository] tofu:         }
06:57:02.357 STDOUT [repository] tofu:       + "infra-live:bug"          = {
06:57:02.357 STDOUT [repository] tofu:           + color       = "d73a4a"
06:57:02.357 STDOUT [repository] tofu:           + description = "Something isn't working"
06:57:02.357 STDOUT [repository] tofu:           + name        = "bug"
06:57:02.357 STDOUT [repository] tofu:           + repository  = "infra-live"
06:57:02.357 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.357 STDOUT [repository] tofu:         }
06:57:02.357 STDOUT [repository] tofu:       + "infra-live:stuff"        = {
06:57:02.357 STDOUT [repository] tofu:           + color       = "a2eeef"
06:57:02.357 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
06:57:02.357 STDOUT [repository] tofu:           + name        = "stuff"
06:57:02.357 STDOUT [repository] tofu:           + repository  = "infra-live"
06:57:02.357 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.357 STDOUT [repository] tofu:         }
06:57:02.357 STDOUT [repository] tofu:       + "infra-modules:bug"       = {
06:57:02.357 STDOUT [repository] tofu:           + color       = "d73a4a"
06:57:02.357 STDOUT [repository] tofu:           + description = "Something isn't working"
06:57:02.357 STDOUT [repository] tofu:           + name        = "bug"
06:57:02.357 STDOUT [repository] tofu:           + repository  = "infra-modules"
06:57:02.357 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.357 STDOUT [repository] tofu:         }
06:57:02.357 STDOUT [repository] tofu:       + "infra-modules:stuff"     = {
06:57:02.357 STDOUT [repository] tofu:           + color       = "a2eeef"
06:57:02.357 STDOUT [repository] tofu:           + description = "Stuff & Stuff"
06:57:02.357 STDOUT [repository] tofu:           + name        = "stuff"
06:57:02.357 STDOUT [repository] tofu:           + repository  = "infra-modules"
06:57:02.358 STDOUT [repository] tofu:           + url         = (known after apply)
06:57:02.358 STDOUT [repository] tofu:         }
06:57:02.358 STDOUT [repository] tofu:     }
06:57:02.358 STDOUT [repository] tofu:   + milestones    = {
06:57:02.358 STDOUT [repository] tofu:       + ".github:Phase 1: Milestone 1"           = {
06:57:02.358 STDOUT [repository] tofu:           + description = "Milestone 1"
06:57:02.358 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
06:57:02.358 STDOUT [repository] tofu:           + number      = (known after apply)
06:57:02.358 STDOUT [repository] tofu:           + repository  = ".github"
06:57:02.358 STDOUT [repository] tofu:           + state       = "open"
06:57:02.358 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
06:57:02.358 STDOUT [repository] tofu:         }
06:57:02.358 STDOUT [repository] tofu:       + "github-management:Phase 1: Milestone 1" = {
06:57:02.358 STDOUT [repository] tofu:           + description = "Milestone 1"
06:57:02.358 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
06:57:02.358 STDOUT [repository] tofu:           + number      = (known after apply)
06:57:02.358 STDOUT [repository] tofu:           + repository  = "github-management"
06:57:02.358 STDOUT [repository] tofu:           + state       = "open"
06:57:02.358 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
06:57:02.358 STDOUT [repository] tofu:         }
06:57:02.358 STDOUT [repository] tofu:       + "gitops:Phase 1: Milestone 1"            = {
06:57:02.358 STDOUT [repository] tofu:           + description = "Milestone 1"
06:57:02.358 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
06:57:02.358 STDOUT [repository] tofu:           + number      = (known after apply)
06:57:02.358 STDOUT [repository] tofu:           + repository  = "gitops"
06:57:02.358 STDOUT [repository] tofu:           + state       = "open"
06:57:02.358 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
06:57:02.358 STDOUT [repository] tofu:         }
06:57:02.358 STDOUT [repository] tofu:       + "infra-live:Phase 1: Milestone 1"        = {
06:57:02.359 STDOUT [repository] tofu:           + description = "Milestone 1"
06:57:02.359 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
06:57:02.359 STDOUT [repository] tofu:           + number      = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + repository  = "infra-live"
06:57:02.359 STDOUT [repository] tofu:           + state       = "open"
06:57:02.359 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
06:57:02.359 STDOUT [repository] tofu:         }
06:57:02.359 STDOUT [repository] tofu:       + "infra-modules:Phase 1: Milestone 1"     = {
06:57:02.359 STDOUT [repository] tofu:           + description = "Milestone 1"
06:57:02.359 STDOUT [repository] tofu:           + due_date    = "2025-09-01"
06:57:02.359 STDOUT [repository] tofu:           + number      = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + repository  = "infra-modules"
06:57:02.359 STDOUT [repository] tofu:           + state       = "open"
06:57:02.359 STDOUT [repository] tofu:           + title       = "Phase 1: Milestone 1"
06:57:02.359 STDOUT [repository] tofu:         }
06:57:02.359 STDOUT [repository] tofu:     }
06:57:02.359 STDOUT [repository] tofu:   + repositories  = {
06:57:02.359 STDOUT [repository] tofu:       + ".github"         = {
06:57:02.359 STDOUT [repository] tofu:           + description    = "Organization-wide GitHub configurations, workflows, and community templates"
06:57:02.359 STDOUT [repository] tofu:           + full_name      = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + html_url       = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + id             = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + name           = ".github"
06:57:02.359 STDOUT [repository] tofu:           + node_id        = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
06:57:02.359 STDOUT [repository] tofu:           + topics         = [
06:57:02.359 STDOUT [repository] tofu:               + "automation",
06:57:02.359 STDOUT [repository] tofu:               + "community",
06:57:02.360 STDOUT [repository] tofu:               + "github",
06:57:02.360 STDOUT [repository] tofu:               + "templates",
06:57:02.360 STDOUT [repository] tofu:               + "workflows",
06:57:02.360 STDOUT [repository] tofu:             ]
06:57:02.360 STDOUT [repository] tofu:           + visibility     = "public"
06:57:02.360 STDOUT [repository] tofu:         }
06:57:02.360 STDOUT [repository] tofu:       + github-management = {
06:57:02.360 STDOUT [repository] tofu:           + description    = "Infrastructure as Code for GitHub organization, repositories, and security management"
06:57:02.360 STDOUT [repository] tofu:           + full_name      = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + html_url       = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + id             = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + name           = "github-management"
06:57:02.360 STDOUT [repository] tofu:           + node_id        = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + topics         = [
06:57:02.360 STDOUT [repository] tofu:               + "automation",
06:57:02.360 STDOUT [repository] tofu:               + "github",
06:57:02.360 STDOUT [repository] tofu:               + "infrastructure",
06:57:02.360 STDOUT [repository] tofu:               + "security",
06:57:02.360 STDOUT [repository] tofu:               + "terraform",
06:57:02.360 STDOUT [repository] tofu:             ]
06:57:02.360 STDOUT [repository] tofu:           + visibility     = "public"
06:57:02.360 STDOUT [repository] tofu:         }
06:57:02.360 STDOUT [repository] tofu:       + gitops            = {
06:57:02.360 STDOUT [repository] tofu:           + description    = "GitOps repository for Kubernetes application deployments using ArgoCD and Helm"
06:57:02.360 STDOUT [repository] tofu:           + full_name      = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + html_url       = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + id             = (known after apply)
06:57:02.360 STDOUT [repository] tofu:           + name           = "gitops"
06:57:02.360 STDOUT [repository] tofu:           + node_id        = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + topics         = [
06:57:02.361 STDOUT [repository] tofu:               + "argocd",
06:57:02.361 STDOUT [repository] tofu:               + "deployments",
06:57:02.361 STDOUT [repository] tofu:               + "gitops",
06:57:02.361 STDOUT [repository] tofu:               + "helm",
06:57:02.361 STDOUT [repository] tofu:               + "kubernetes",
06:57:02.361 STDOUT [repository] tofu:             ]
06:57:02.361 STDOUT [repository] tofu:           + visibility     = "public"
06:57:02.361 STDOUT [repository] tofu:         }
06:57:02.361 STDOUT [repository] tofu:       + infra-live        = {
06:57:02.361 STDOUT [repository] tofu:           + description    = "Live infrastructure configurations managed with Terragrunt for environment-specific deployments"
06:57:02.361 STDOUT [repository] tofu:           + full_name      = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + html_url       = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + id             = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + name           = "infra-live"
06:57:02.361 STDOUT [repository] tofu:           + node_id        = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
06:57:02.361 STDOUT [repository] tofu:           + topics         = [
06:57:02.361 STDOUT [repository] tofu:               + "environments",
06:57:02.361 STDOUT [repository] tofu:               + "infrastructure",
06:57:02.361 STDOUT [repository] tofu:               + "production",
06:57:02.361 STDOUT [repository] tofu:               + "terraform",
06:57:02.361 STDOUT [repository] tofu:               + "terragrunt",
06:57:02.361 STDOUT [repository] tofu:             ]
06:57:02.361 STDOUT [repository] tofu:           + visibility     = "public"
06:57:02.361 STDOUT [repository] tofu:         }
06:57:02.362 STDOUT [repository] tofu:       + infra-modules     = {
06:57:02.362 STDOUT [repository] tofu:           + description    = "Reusable Terraform modules for cloud infrastructure and Kubernetes platform components"
06:57:02.362 STDOUT [repository] tofu:           + full_name      = (known after apply)
06:57:02.362 STDOUT [repository] tofu:           + html_url       = (known after apply)
06:57:02.362 STDOUT [repository] tofu:           + http_clone_url = (known after apply)
06:57:02.362 STDOUT [repository] tofu:           + id             = (known after apply)
06:57:02.362 STDOUT [repository] tofu:           + name           = "infra-modules"
06:57:02.362 STDOUT [repository] tofu:           + node_id        = (known after apply)
06:57:02.362 STDOUT [repository] tofu:           + ssh_clone_url  = (known after apply)
06:57:02.362 STDOUT [repository] tofu:           + topics         = [
06:57:02.362 STDOUT [repository] tofu:               + "cloud",
06:57:02.362 STDOUT [repository] tofu:               + "infrastructure",
06:57:02.362 STDOUT [repository] tofu:               + "kubernetes",
06:57:02.362 STDOUT [repository] tofu:               + "modules",
06:57:02.362 STDOUT [repository] tofu:               + "terraform",
06:57:02.362 STDOUT [repository] tofu:             ]
06:57:02.362 STDOUT [repository] tofu:           + visibility     = "public"
06:57:02.362 STDOUT [repository] tofu:         }
06:57:02.362 STDOUT [repository] tofu:     }
06:57:02.380 WARN   [repository] Config ./membership/terragrunt.hcl is a dependency of ./repository/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
06:57:02.383 WARN   [organization] Config ./membership/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
06:57:02.433 WARN   [organization] Config ./repository/terragrunt.hcl is a dependency of ./organization/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
06:57:02.954 STDOUT [organization] tofu: OpenTofu used the selected providers to generate the following execution
06:57:02.954 STDOUT [organization] tofu: plan. Resource actions are indicated with the following symbols:
06:57:02.954 STDOUT [organization] tofu:   + create
06:57:02.954 STDOUT [organization] tofu: OpenTofu will perform the following actions:
06:57:02.954 STDOUT [organization] tofu:   # github_organization_security_manager.security_manager_team will be created
06:57:02.954 STDOUT [organization] tofu:   + resource "github_organization_security_manager" "security_manager_team" {
06:57:02.954 STDOUT [organization] tofu:       + id        = (known after apply)
06:57:02.954 STDOUT [organization] tofu:       + team_slug = "admin"
06:57:02.954 STDOUT [organization] tofu:     }
06:57:02.954 STDOUT [organization] tofu:   # github_organization_settings.main will be created
06:57:02.954 STDOUT [organization] tofu:   + resource "github_organization_settings" "main" {
06:57:02.954 STDOUT [organization] tofu:       + advanced_security_enabled_for_new_repositories               = true
06:57:02.954 STDOUT [organization] tofu:       + billing_email                                                = "your-email@example.com"
06:57:02.954 STDOUT [organization] tofu:       + default_repository_permission                                = "read"
06:57:02.954 STDOUT [organization] tofu:       + dependabot_alerts_enabled_for_new_repositories               = true
06:57:02.954 STDOUT [organization] tofu:       + dependabot_security_updates_enabled_for_new_repositories     = true
06:57:02.954 STDOUT [organization] tofu:       + dependency_graph_enabled_for_new_repositories                = true
06:57:02.955 STDOUT [organization] tofu:       + description                                                  = "Github Organization Playground example"
06:57:02.955 STDOUT [organization] tofu:       + has_organization_projects                                    = true
06:57:02.955 STDOUT [organization] tofu:       + has_repository_projects                                      = false
06:57:02.955 STDOUT [organization] tofu:       + id                                                           = (known after apply)
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_internal_repositories                     = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_pages                                     = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_private_pages                             = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_private_repositories                      = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_public_pages                              = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_public_repositories                       = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_create_repositories                              = false
06:57:02.955 STDOUT [organization] tofu:       + members_can_fork_private_repositories                        = false
06:57:02.955 STDOUT [organization] tofu:       + name                                                         = "Example"
06:57:02.955 STDOUT [organization] tofu:       + secret_scanning_enabled_for_new_repositories                 = true
06:57:02.956 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled_for_new_repositories = true
06:57:02.956 STDOUT [organization] tofu:       + web_commit_signoff_required                                  = false
06:57:02.956 STDOUT [organization] tofu:     }
06:57:02.956 STDOUT [organization] tofu: Plan: 2 to add, 0 to change, 0 to destroy.
06:57:02.956 STDOUT [organization] tofu: Changes to Outputs:
06:57:02.956 STDOUT [organization] tofu:   + organization     = {
06:57:02.956 STDOUT [organization] tofu:       + advanced_security_enabled               = true
06:57:02.956 STDOUT [organization] tofu:       + billing_email                           = "your-email@example.com"
06:57:02.956 STDOUT [organization] tofu:       + blog                                    = null
06:57:02.956 STDOUT [organization] tofu:       + default_repository_permission           = "read"
06:57:02.956 STDOUT [organization] tofu:       + dependabot_alerts_enabled               = true
06:57:02.956 STDOUT [organization] tofu:       + dependabot_security_updates_enabled     = true
06:57:02.957 STDOUT [organization] tofu:       + dependency_graph_enabled                = true
06:57:02.957 STDOUT [organization] tofu:       + description                             = "Github Organization Playground example"
06:57:02.957 STDOUT [organization] tofu:       + email                                   = null
06:57:02.957 STDOUT [organization] tofu:       + has_organization_projects               = true
06:57:02.957 STDOUT [organization] tofu:       + location                                = null
06:57:02.957 STDOUT [organization] tofu:       + name                                    = "Example"
06:57:02.957 STDOUT [organization] tofu:       + secret_scanning_enabled                 = true
06:57:02.957 STDOUT [organization] tofu:       + secret_scanning_push_protection_enabled = true
06:57:02.957 STDOUT [organization] tofu:       + web_commit_signoff_required             = false
06:57:02.957 STDOUT [organization] tofu:     }
06:57:02.957 STDOUT [organization] tofu:   + security_manager = {
06:57:02.957 STDOUT [organization] tofu:       + team_slug = "admin"
06:57:02.957 STDOUT [organization] tofu:     }
```

</details>
    
